darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  sleep_init();
  sleep_load_persistent(persist);
#ifdef SLEEP_MODE_CONTINUOUS
  persist.wakeupCount++;
  sleep_save_persistent(persist);
#endif

  lcd_init(lcd);

#ifdef LEGACY_HX711_PINS
  // Старая распиновка использует TX (GPIO1) как HX711 SCK.
  // Закрываем Serial чтобы не было UART-мусора на линии clock.
  Serial.flush();
  Serial.end();
#endif
  scale_init(scale, DT_PIN, SCK_PIN);
  sys.sensorReady = check_sensor(scale);

  bool rtcOk = rtc_init();

  if (!temp_init()) {
    Serial.println(F("[Temp] No sensor, readings disabled"));
  }

  load_calibration_data(sys.calibrationFactor, sys.offset, sys.lastSavedWeight);
  sys.prevOffset = load_prev_offset();
  web_settings_init();
  ext_settings_init();
  sched_settings_init();
  tg_report_settings_init();
  tg_settings_init();
  credentials_init();
  // prevWeight при загрузке из EEPROM addr 30 (эталон пользователя).
  // Fallback на lastSavedWeight если EEPROM addr 30 ещё не записан.
  sys.prevWeight = load_prev_weight(sys.lastSavedWeight);

  bat_init();

  if (sys.sensorReady) {
    scale.set_scale(sys.calibrationFactor);
    scale.set_offset(sys.offset);
  }

  yield();
  sys.wifiOk = wifi_init();  // Инициализация WiFi (AP или STA режим)
  yield();

  yield();
  show_splash_screen();
  yield();
  if (sys.wifiOk) {
    Serial.println(F("[WiFi] Connected"));
    Serial.print(F("[WiFi] IP: "));
    Serial.println(WiFi.status() == WL_CONNECTED ? WiFi.localIP() : WiFi.softAPIP());
    if (get_wifi_mode() == 1) {
      ntp_sync_time();  // Синхронизация времени (только в STA режиме)
    }
    start_webserver();
    // ArduinoOTA — обновление прошивки по воздуху. Пароль хранится в EEPROM,
    // дефолт "ota_beehive" при пустом блоке credentials (UI показывает warning).
    ArduinoOTA.setHostname("beehivescale");
    {
      char otaPassBuf[32];
      get_ota_pass(otaPassBuf, sizeof(otaPassBuf));
      ArduinoOTA.setPassword(otaPassBuf);
    }
    ArduinoOTA.onStart([]() { lastActivityTime = millis(); });
    ArduinoOTA.onProgress([](unsigned int, unsigned int) { lastActivityTime = millis(); });
    ArduinoOTA.begin();
  } else {
    Serial.println(F("[WiFi] Initialization failed!"));
  }

  log_init();
  lastActivityTime = millis();
#if defined(ESP8266)
  ESP.wdtEnable(8000);  // Включаем программный WDT обратно: 8 сек
#endif

  // Сбросить ISR-флаги кнопок: при boot D3 (GPIO0) и D4 (GPIO2) — boot-strap пины,
  // на них происходят переходные процессы → FALLING-прерывания ловят ложные нажатия.
  // Чистим флаги перед стартом loop, чтобы не было автотарирования при включении.
  noInterrupts();
  btnMain.irqFell = false;
  btnMain.irqTime = 0;
  btnMenu.irqFell = false;
  btnMenu.irqTime = 0;
  interrupts();

  Serial.println(F("[Setup] Done"));
}

void start_webserver() {
  if (webServerStarted) return;

  WebData wd;
  wd.weight          = &sys.smoothedWeight;
  wd.lastSavedWeight = &sys.lastSavedWeight;
  wd.tempC           = &sys.tempData.temperature;
  // humidity поле убрано (пункт 22) — нет физического датчика.
  wd.rtcTempC        = &sys.rtcTempC;
  wd.calibFactor     = &sys.calibrationFactor;
  wd.offset          = &sys.offset;
  wd.sensorReady     = &sys.sensorReady;
  wd.wifiOk          = &sys.wifiOk;
  wd.datetime        = &sys.datetimeStr;
  wd.wakeupCount     = &persist.wakeupCount;
  wd.batVoltage      = &sys.batVoltage;
  wd.batPercent      = &sys.batPercent;
  wd.prevWeight      = &sys.prevWeight;
  wd.lastReportWeight = &persist.lastReportWeight;
  wd.hasLastReport    = &persist.hasLastReport;

  WebActions wa;
  wa.doTare = perform_taring;
  wa.doSave = []() {
    sys.prevWeight = sys.smoothedWeight;
    save_weight(sys.lastSavedWeight, sys.smoothedWeight);
    save_prev_weight(sys.prevWeight);
    // Сохраняем дату фиксации (для UI "зафикс. от ДД.ММ.ГГГГ")
    TimeStamp ts = rtc_now();
    if (ts.valid) {
      DateTime dt(ts.year, ts.month, ts.day, ts.hour, ts.minute, ts.second);
      save_prev_weight_date(dt.unixtime());
    }
  };
  wa.onActivity = []() { lcd_backlight_activity(lcd); };
  wa.doSetCalibFactor = [](float cf) {
    sys.calibrationFactor = cf;
    scale.set_scale(cf);
    save_calibration(cf);
  };
  wa.doSetCalibOffset = [](long ofs) {
    sys.offset = ofs;
    scale.set_offset(ofs);
    save_offset(ofs);
  };

  webserver_init(wd, wa);
  webServerStarted = true;
}

void loop() {
  app_wdt_reset();
  if (sys.wifiOk) {
    ArduinoOTA.handle();
#if defined(ESP8266)
    MDNS.update();
#endif
  }
  static unsigned long lastTempRead   = 0;
  static unsigned long lastTsUpload   = 0;
  static unsigned long lastTgReport   = millis();
  static unsigned long lastBatRead    = 0;
  static unsigned long lastLogWrite   = 0;
  static unsigned long lastSensorChk  = 0;  // фича 14: watchdog HX711
  static int           sensorFailCnt  = 0;
  unsigned long now = millis();

  if (now - lastTempRead >= TEMP_READ_INTERVAL_MS) {
    if (temp_available()) {
      process_temperature();
    }
    sys.currentTime = rtc_now();
    sys.rtcTempC = rtc_temperature();
    // Обновляем datetimeStr сразу после RTC-чтения, чтобы log_append ниже
    // использовал актуальное время (не из прошлой итерации цикла).
    if (sys.currentTime.valid) {
      sys.datetimeStr = rtc_format_datetime(sys.currentTime);
    } else {
      // RTC недоступен — используем uptime как fallback, чтобы запись в лог не блокировалась
      unsigned long sec = millis() / 1000;
      char tb[20];
      snprintf(tb, sizeof(tb), "01.01.2020 %02lu:%02lu:%02lu",
               (sec / 3600) % 24, (sec / 60) % 60, sec % 60);
      sys.datetimeStr = tb;
    }
    lastTempRead = now;
    sys.needsRedraw = true;
  }

  if (now - lastBatRead >= BAT_READ_INTERVAL_MS) {
    sys.batVoltage = bat_voltage();
    sys.batPercent  = bat_percent();
    lastBatRead = now;
    sys.needsRedraw = true;
  }

  handle_buttons();
  process_weight();

  // Auto-return на главный экран (1/8) если 20 сек никто не трогал кнопки.
  // Не применяется на экранах 6 (calib menu) и 7 (diag) — там пользователь работает с интерфейсом.
  static const unsigned long AUTO_HOME_MS = 20000UL;
  if (sys.menuScreen != 0 && sys.menuScreen != 6 && sys.menuScreen != 7
      && (millis() - lastActivityTime) > AUTO_HOME_MS) {
    sys.menuScreen = 0;
    sys.needsRedraw = true;
  }

  update_interface();

  // ── Фича 14: Watchdog HX711 — авто-перезапуск датчика при зависании ──
  if (now - lastSensorChk >= 5000UL) {
    lastSensorChk = now;
    if (!scale.is_ready()) {
      sensorFailCnt++;
      if (sensorFailCnt >= 6) {  // 6 × 5с = 30с без ответа → перезапуск
        Serial.println(F("[HX711] Watchdog: reinit"));
        scale_init(scale, DT_PIN, SCK_PIN);
        sys.sensorReady = check_sensor(scale);
        if (sys.sensorReady) {
          scale.set_scale(sys.calibrationFactor);
          scale.set_offset(sys.offset);
          sys.emaInitialized = false;
          sys.smoothedWeight = 0.0f;
          Serial.println(F("[HX711] Recovered"));
        }
        sensorFailCnt = 0;
      }
    } else {
      sensorFailCnt = 0;
      if (!sys.sensorReady) {
        sys.sensorReady = true;
        sys.needsRedraw = true;
      }
    }
  }

  // В deep sleep режиме лог пишется один раз перед сном (ниже), здесь пропускаем
#ifndef SLEEP_MODE_DEEP_SLEEP
  {
    static uint16_t _lastSchedLogMin = 0xFFFF;
    static bool _bootLogDone = false;
    uint16_t stimes[8]; uint8_t scnt;
    get_sched_times(stimes, scnt);
    bool schedLog = false;
    if (sys.currentTime.valid && scnt > 0) {
      uint16_t cur_min = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      for (uint8_t i = 0; i < scnt; i++) {
        if (stimes[i] == cur_min && _lastSchedLogMin != cur_min) {
          _lastSchedLogMin = cur_min; schedLog = true; break;
        }
      }
    }
    // Запись при каждом включении (однократно, как только датчик готов)
    bool bootLog = false;
    if (!_bootLogDone && sys.sensorReady && sys.currentTime.valid) {
      _bootLogDone = true;
      if (!schedLog) {  // не дублировать если это уже расписанное время
        bootLog = true;
        // предотвратить повторное срабатывание schedLog в эту же минуту
        if (sys.currentTime.valid)
          _lastSchedLogMin = (uint16_t)sys.currentTime.hour * 60 + sys.currentTime.minute;
      }
    }
    bool useInterval = (scnt == 0);  // интервал только если расписание не задано
    if (schedLog || bootLog || (useInterval && now - lastLogWrite >= LOG_INTERVAL_MS)) {
      log_append(sys.datetimeStr, sys.smoothedWeight,
                 sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
      // При срабатывании расписания — ставим флаг отправки TG-отчёта.
      // Это решает проблему "ESP спит между расписаниями": каждое запланированное
      // пробуждение в 09:00, 14:00, 21:00 → одна отправка в Telegram с весом и дельтой.
      if (schedLog) tgReportPending = true;
      lastLogWrite = now;
    }
  }
#endif

  lcd_backlight_tick(lcd, get_lcd_bl_sec());

  wifi_ensure_connected();
  // Определяем "эффективный" режим WiFi по факту, а не из EEPROM:
  // если STA-подключение упало и wifi_init() сделал fallback на AP, EEPROM остаётся в STA,
  // но реально работаем в AP. Без этой проверки веб-сервер останавливается через 7 сек.
  bool isApMode = (get_wifi_mode() == 0) || (WiFi.getMode() == WIFI_AP);
  if (isApMode) {
    sys.wifiOk = (WiFi.softAPIP() != IPAddress(0,0,0,0));
  } else {
    sys.wifiOk = (WiFi.status() == WL_CONNECTED);
    if (!sys.wifiOk && webServerStarted) {
      // Корректно останавливаем web-сервер перед сбросом флага — иначе при
      // реконнекте повторный _srv.begin() поверх живого слушающего сокета
      // может вести к утечкам / двойным handlers (пункт 7).
      webserver_stop();
      webServerStarted = false;
    }
    ntp_loop();
  }

