darkvolg/BeehiveScale-ESP32/BeehiveScale/BeehiveScale.ino
  // Читаем сырое значение (get_value = ADC - offset, scale=1)
  double rawD = scale.get_value(SCALE_CALIB_SAMPLES);
  float raw = (float)rawD;
  Serial.print(F("[Calib] raw ADC units=")); Serial.println(raw, 0);

  if (fabsf(raw) < 1000.0f) {
    // Первая попытка не удалась — power-cycle и повтор
    Serial.print(F("[Calib] raw too small=")); Serial.println(raw, 0);
    Serial.println(F("[Calib] Retrying after power cycle..."));
    scale.power_down();
    delayMicroseconds(100);
    scale.power_up();
    delay(400);
    scale.set_scale(1.0f);
    scale.set_offset(zeroOffset);  // восстанавливаем offset от tare
    if (scale.wait_ready_timeout(3000)) {
      rawD = scale.get_value(SCALE_CALIB_SAMPLES);
      raw = (float)rawD;
      Serial.print(F("[Calib] Retry raw=")); Serial.println(raw, 0);
    }
    if (fabsf(raw) < 1000.0f) {
      lcd.clear();
      lcd.setCursor(0, 0); lcd_print_padded(lcd, "OSHIBKA raw=0   ");
      char dbg[17]; snprintf(dbg, sizeof(dbg), "raw=%.0f", raw);
      lcd.setCursor(0, 1); lcd_print_padded(lcd, dbg);
      Serial.print(F("[Calib] ERROR: raw too small=")); Serial.println(raw, 0);
      { unsigned long _t0=millis(); while(millis()-_t0<3000UL){app_wdt_reset();yield();} }
      sys.needsRedraw = true; lastActivityTime = millis();
      return;
    }
  }
  // Знак raw сохраняем: при «обратном» подключении тензодатчика raw<0,
  // тогда calibrationFactor получится отрицательный, и HX711 lib вернёт
  // положительный вес во время работы. Инверсию из b74c04d убрали —
  // она ломала показания при реальном reverse-подключении.

  sys.calibrationFactor = raw / (web_get_calib_weight() / 1000.0f);
  scale.set_scale(sys.calibrationFactor);
  save_calibration(sys.calibrationFactor);
  // Сохраняем новый offset — scale.tare() внутри калибровки изменил его
  sys.offset = scale.get_offset();
  save_offset(sys.offset);
  // Обновляем prevOffset чтобы "отмена тары" не откатила к до-калибровочному offset
  sys.prevOffset = sys.offset;
  sys.hasPrevOffset = false;
  save_prev_offset(sys.prevOffset);
  // Сбрасываем EMA и smoothedWeight — иначе spike-фильтр заблокирует новые показания
  sys.smoothedWeight = 0.0f;
  sys.emaInitialized = false;

  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "OK! Factor:     ");
  { char _cbuf[16]; dtostrf(sys.calibrationFactor, 7, 3, _cbuf); lcd.setCursor(0, 1); lcd_print_padded(lcd, _cbuf); }
  app_wdt_reset();
  { unsigned long _t0=millis(); while(millis()-_t0<2500UL){app_wdt_reset();yield();} }
  sys.needsRedraw = true;
  lastActivityTime = millis();
  Serial.print(F("[Calib] Factor=")); Serial.println(sys.calibrationFactor, 4);
}

void check_auto_sleep() {
  uint16_t autoSec = get_autosleep_sec();
  if (autoSec == 0) return;  // 0 = не засыпать (отладка / постоянное питание)
  unsigned long autoMs = (unsigned long)autoSec * 1000UL;
  if (millis() - lastActivityTime < autoMs) return;

  Serial.print(F("[AutoSleep] "));
  Serial.print(autoSec);
  Serial.println(F(" sec idle — shutting down..."));

  // Показываем сообщение на LCD (включаем подсветку — она могла быть выключена по таймауту)
  lcd.backlight();
  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, "Auto sleep...   ");
  lcd.setCursor(0, 1); lcd_print_padded(lcd, "Btn to wake up  ");
  { unsigned long _t0=millis(); while(millis()-_t0<3000UL){app_wdt_reset();yield();} }

  // Гасим подсветку LCD и очищаем DDRAM (иначе остаются "квадратики" от старых символов)
  lcd.clear();
  lcd.noBacklight();
  lcd.noDisplay();  // ESP32-bonus: ещё снижает потребление PCF8574

  // Отключаем WiFi
#if defined(ESP32)
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
#elif defined(ESP8266)
  WiFi.disconnect(true);
  WiFi.mode(WIFI_OFF);
#endif
  if (webServerStarted) webserver_stop();
  webServerStarted = false;

  // Записываем лог перед сном
  {
    log_append(sys.datetimeStr, sys.smoothedWeight,
               sys.tempData.temperature, sys.tempData.humidity, sys.batVoltage, sys.batPercent);
  }

  // Сохраняем данные
  save_weight(sys.lastSavedWeight, sys.smoothedWeight);
  save_prev_weight(sys.prevWeight);   // сохраняем опорный вес дельты перед сном
  persist.lastWeight = sys.smoothedWeight;
  persist.lastTempC = sys.tempData.temperature;
  persist.wakeupCount++;
  sleep_save_persistent(persist);

  // HX711 → power_down: standby ~1.5 мА → ~1 мкА. Просыпается scale.power_up() в setup().
  scale.power_down();

  // Уходим в deep sleep (пробуждение по кнопке GPIO 0)
#if defined(ESP32)
  esp_task_wdt_delete(NULL);
#endif
  { uint32_t sleepDur = sys.currentTime.valid
      ? sched_next_sec(sys.currentTime.hour, sys.currentTime.minute)
      : get_sleep_sec();
    // Защита от циклов "проснулся → уснул на 0 сек → проснулся": минимум 60 сек.
    // Если попали в минуту расписания — sched_next_sec может вернуть 0 → не циклим, ждём минуту.
    if (sleepDur < 60) sleepDur = 60;
    Serial.print(F("[AutoSleep] Sleep for "));
    Serial.print(sleepDur);
    Serial.println(F(" sec"));
    sleep_enter(sleepDur);
  }
}

void show_splash_screen() {
  lcd.clear();
  lcd.setCursor(0, 0); lcd_print_padded(lcd, " Vesy Pchelovod ");
  char verLine[17];
  snprintf(verLine, sizeof(verLine), "  Versiya %s", FW_VERSION);
  lcd.setCursor(0, 1); lcd_print_padded(lcd, verLine);
  { unsigned long _t0=millis(); while(millis()-_t0<1200UL){app_wdt_reset();yield();} }

  if (sys.sensorReady) {
    float current = scale_read_weight(scale, 5);
    if (!isnan(current)) {
      float diff = current - sys.lastSavedWeight;
      char buf[17];
      snprintf(buf, sizeof(buf), "VES: %+6.2f kg", diff);
      lcd.setCursor(0, 1);
      lcd_print_padded(lcd, buf);
      { unsigned long _t0=millis(); while(millis()-_t0<2500UL){app_wdt_reset();yield();} }
    }
  }

  lcd.clear();
  sys.needsRedraw = true;
}

